; -----------------------------------------------------------------------------
;
; Universal Extractor Language File / Finnish (suomi)
; Written for Universal Extractor 1.6
; Universal Extractor Author:	Jared Breland <jbreland@legroom.net>  Homepage:	http://www.legroom.net/mysoft
; Author of this language file: Teijo Sakkara <teijo-at-nettilinja.fi>
;
; Translation Instructions:
;	Copy this file to a new file named after the new language
;		Eg: A language file for the German language would be named German.ini.
;	Replace the English words and phrases with their native equivalents,
;		attempting to match the English phrasing and case-sensitivity as
;		closely as possible for the sake of consistency
;	Update the Author and Homepage information at the top of your new language
;		file.  Simply delete the Homepage line if you don't have one.
;	Save the file in Unicode (UTF-8) format and Zip it to preserve formatting
;	E-mail new language files to jbreland@legroom.net for inclusion in main
;		Universal Extractor installer
;
;	The following symbols have special meanings:
;	& - when used in a GUI label or button, it precedes the letter that will
;		be registered as a "hotkey" for that function
;	%n - indicates a newline character, which will be replaced when displayed
;	%t - indicates a tab character, which will be replaced when displayed
;	%s - indicates a string variable that UniExtract will replace when displayed
;		The contents each %s variables is hardocded into UniExtract.
;		The order and number of %s variables is very important and should not
;		be modified.
;
; -----------------------------------------------------------------------------

[UniExtract]
; GUI labels and buttons
OK_BUT = "&OK"
CANCEL_BUT = "&Peruuta"
MAIN_DEST_DIR_LABEL = "&Kohdekansio:"
MAIN_FILE_LABEL = "Purettava paketti tai &asennusohjelma:"
MENU_FILE_LABEL = "&Tiedosto"
MENU_FILE_QUIT_LABEL = "&Lopeta"
MENU_EDIT_LABEL = "&Muokkaa"
MENU_EDIT_PREFS_LABEL = "&Asetukset"
MENU_HELP_LABEL = "&Ohje"
MENU_HELP_WEB_LABEL = "%s &Kotisivut (www)"
PREFS_TITLE_LABEL = "Asetukset"
PREFS_UNIEXTRACT_OPTS_LABEL = "Universal Extractorin asetukset"
PREFS_HISTORY_LABEL = "Muista tiedostohistoria"
PREFS_FORMAT_OPTS_LABEL = "Tiedostotyyppikohtaiset lisдasetukset"
PREFS_LANG_LABEL = "&Kieli"
PREFS_DEBUG_LABEL = "&Virhelokin kansio:"
PREFS_WARN_EXECUTE_LABEL = "Varoita ennen suoritusta"
PREFS_REMOVE_DUPE_LABEL = "Poista &kaksoiskappaleet"
PREFS_REMOVE_TEMP_LABEL = "Poista &vдliaikaistiedostot"
PREFS_APPEND_EXT_LABEL = "&Lisдд puuttuvat tiedostopддtteet"
METHOD_ADMIN_RADIO = "%s Jдrjestelmдnvalvojan asennus"
METHOD_EXTRACTION_RADIO = "%s purkaminen"
METHOD_HEADER = "%s -paketin purku"
METHOD_MSI_NOTE_LABEL = "Huom:"
METHOD_MSI_REQUIRES_LABEL = "msi2xml vaatii"
METHOD_MSI_URL_LABEL = "MSXML 4.0 Parser"
METHOD_RADIO_LABEL = "Purkumenetelmд"
METHOD_SWITCH_RADIO = "%s valintakytkimellд"
METHOD_NOTIS_RADIO = "Ei ole InstallShield-asennusohjelma"
METHOD_TEXT_LABEL = "%s tukee seuraavanlaisia menetelmiд purkaa %s -paketteja. Valitettavasti mikддn menetelmistд ei ole 100% luotettava.  Jollei oletustapa nдytд toimivan, suorita uudestaan %s ja valitse toinen purkumenetelmд."
METHOD_UNPACKER_RADIO = "%s Purkaaja"

; GUI control functions
DOES_NOT_EXIST = "ei ole olemassa.%n"
EXTRACT_TO = "Purkaa kohteeseen"
INVALID_DIR_SELECTED =  "%s ei ole kelvollinen kansio."
INVALID_FILE_SELECTED = "%s Valitse kelvollinen tiedosto."
OPEN_FILE = "Avaa tiedosto"
SELECT_FILE = "Valitse tiedosto"
WRITE_TO = "Kirjoita kohteeseen"

; Common terms
TERM_ARCHIVE = "paketti"
TERM_COMPRESSED = "pakattu tiedosto"
TERM_DISK = "levy"
TERM_EBOOK = "eBook"
TERM_ECARD = "eCard"
TERM_ENCODED = "koodattu tiedosto"
TERM_EXECUTABLE = "sovellus"
TERM_FAILED = "epдonnistui"
TERM_HELP = "ohjetiedosto"
TERM_HOTFIX = "hotfix"
TERM_IMAGE = "levykuva"
TERM_INSTALLER = "asennusohjelma"
TERM_PACKAGE = "paketti"
TERM_PATCH = "korjauspдivitys"
TERM_SFX = "itsepurkautuva"
TERM_STAGE = "vaihe"
TERM_SUCCEEDED = "onnistui"
TERM_TESTING = "testataan"
TERM_UNKNOWN = "tuntematon"
TERM_UNPACKED = "pakkaamaton"
TERM_UPDATER = "pдivitysohjelma"

; Status messages
SCANNING_FILE = "Tutkitaan tiedoston tyyppiд..."
SCANNING_EXE = "Tutkitaan tiedostoa '%s'."
EXTRACTING = "Puretaan kohde:"
INIT_WAIT = "Asennusohjelma kдynnistyy.%nOdota."

; Custom prompts
CONVERT_CDROM = "BIN/CUE CD-ROM-levykuvia ei voi purkaa suoraan. Tдmд levykuva%n muunnetaan ennen purkamista ensin ISO CD-ROM-levykuvaksi.%n%nJatketaanko?%nHuom! Muuntoprosessi voi kestдд useita minuutteja."
CONVERT_CDROM_STAGE1_FAILED = "VIRHE:  BIN/CUE-levykuvaa ei voitu muuntaa.%nVarmista, ettд CUE-tiedoston rakenne on oikeellinen."
CONVERT_CDROM_STAGE2_FAILED = "VIRHE:  ISO-levykuva luotiin BIN/CUE-levykuvasta, mutta sitд ei voitu muuntaa.%nSддstetддnkц ISO-levykuva jatkotutkimuksia varten?"
CONVERT_BIN_MISSING = "VIRHE: Ei lцydy tiedostoja:%n'%s'\'%s.%s'%n%nSekд '%s.bin' ettд '%s.cue' tarvitaan."
;IS_CACHE_PROMPT = "Tiedoston tunnistettiin olevan InstallShield -asennustiedosto, mutta sen purku epдonnistui.%nVoi olla mahdollista purkaa tiedoston sisдltц suorittamalla se vдlimuistitilassa.%n%nYritetддnkц tдllд menetelmдllд?"
;ACROREAD_PROMPT = "Tiedoston tunnistettiin olevan Netopsystems FEAD Optimizer:lla pakattu Adobe Reader -asennusohjelma.%nVoi olla mahdollista purkaa tiedoston sisдltц suorittamalla asennusohjelma ja kopioimalla vдliaikaistiedostot.%n%nYritetддnkц tдllд menetelmдllд?"
INIT_COMPLETE = "Alustetaan '%s'.  Sulje asennusohjelma ja paina OK jatkaaksesi."
WISE_MSI_PROMPT = "Huom:  Tдmд menetelmд toimii vain tietyillд 'Wise for Windows Installer' -paketeilla.%nIJos 'Wise Installation' -velho kдynnistyy ja odottaa syцtettд, tдtд tiedotomuotoa ei%ntueta.  Sulje asennusohjelma ja %s keskeyttдд purkamisyrityksen.%n%nJatketaanko?"
UNPACK_PROMPT = "Tiedosto on pakattu kдyttдen %s pakkausta, mutta sen purku epдonnistui.%nTдmд voi johtua tukemattomasta tiedostomuodosta tai siitд%nettд pakettitiedostossa ei ole mitддn purettavia tiedostoja.%n%nAvataanko tiedosto purkamisen sijaan?%n%nHuom! Avattu tiedosto nimetддn seuraavasti:%n'%s\'%s_unpacked.%s'"
UNPACK_FAILED = "VIRHE: %s%nei voida purkaa."
WARN_EXECUTE = "VAROITUS:  Tдmдntyyppisten tiedostojen purkamiseksi ne pitдд suorittaa.%nJos jatkat, suoritetaan seuraavanlainen komento:%n%n%s%n%nJos epдilet tiedoston sisдltдvдn haittaohjelmistoja tai viruksia, ei ole suositeltavaa jatkaa.%nJatketaanko?"

 ; Help text
HELP_SUMMARY = "Purkaa paketti tai asennusohjelma."
HELP_SYNTAX = "%nKдyttц:  %s [/help] [tiedostonimi [kohdekansio]]"
HELP_ARGUMENTS = "%n%nTuetut argumentit:"
HELP_HELP = "%n     /help%t%tNдyttдд tдmдn ohjeen"
HELP_FILENAME = "%n     tiedostonimi%tPurettavan tiedoston nimi"
HELP_DESTINATION = "%n     kohdekansio%tKansio johon puretaan"
HELP_SUB = "%n%nKдytettдessд kohdekansion tilalla '/sub' luodaan %n%s pakatun tiedoston niminen alikansio, johon se puretaan."
HELP_EXAMPLE1 = "%n%nEsimerkki:"
HELP_EXAMPLE2 = "%n     %s c:\1\esimerkki.zip c:\testi"
HELP_NOARGS = "%n%nSuoritettaessa %s ilman argumentteja %nkдyttдjдltд kysytддn tiedostonimi ja kohdekansio."

; Error messages
CANNOT_LOG = "'%s' purkamistapahtumia ei voi kirjata lokiin."
CANNOT_DEBUG = "Virhelokia ei voida kirjoittaa kansioon "%s",%njoten se kirjoitetaan tilapдistiedostojen kansioon."
CANNOT_EXTRACT = "'%s' ei voitu purkaa.%nTiedostotyyppi oli: '%s'%n%nValitse 'OK' jos tahdot itse analysoida tiedostoa. Lopettaaksesi valitse 'Peruuta'."
UNKNOWN_EXT = "%s%ntiedostolla on tuntematon pддte joten sitд voi purkaa."
INVALID_DIR = "%s%nei voitu luoda.  Valitse kelvollinen kohdekansio."
EXTRACT_FAILED = "%s ei voitu purkaa.%nTiedoston tunnistettiin olevan %s. Purkaminen epдonnistui vaikka pakkausmuoto onkin tuettu.%nKatso lisдtietoja lokitiedostosta '%s'.%n%nValitse 'OK' avataksesi lokitiedoston. Lopettaaksesi valitse 'Peruuta'."


[Installer]
; Components page
COMP_DOCS = "Dokumentaatio ja lisenssiehdot"
COMP_LANG = "Muut kielitiedostot"
COMP_ACE = "Tuki ACE-tiedostoille"
COMP_KGB = "Tuki KGB-tiedostoille"
COMP_PEA = "Tuki Pea-tiedostoille"
COMP_SIT = "Tuki StuffIt-tiedostoille"

; Preferences page
PREFS_CAPTION = "Ohjelman asetukset"
PREFS_DESCRIPTION = "Mitд Universal Extractor:in asetuksia muutetaan?"
PREFS_LABEL1 = "Voit vaikuttaa alla lueteltuihin toimintoihin."
PREFS_LABEL2 = "Asetuksia voi muuttaa jдlkeenpдin muokkaamalla tiedostoa 'UniExtract.ini'."
LANGUAGE_LABEL = "Oletuskieli"
DEBUG_LABEL = "Virhelokin sijainti"
APPEND_EXT_LABEL = "&Lisдд puuttuvat tiedostopддtteet"
HISTORY_LABEL = "&Muista tiedostohistoria"
REMOVE_DUPE_LABEL = "Poista &kaksoiskappaleet"
REMOVE_TEMP_LABEL = "Poista &vдliaikaistiedostot"
WARN_EXECUTE_LABEL = "Varoita ennen &suoritusta"

; Tasks page
ASSOCIATE = "&Liitд jдrjestelmдn valikoihin"
ASSOCIATE_FILES = "Lisдд jдrjestelmдvalikkoon 'Purkaa &UniExtractorilla...'"
ASSOCIATE_HERE = "Lisдд jдrjestelmдvalikkoon 'Purkaa UniExtractorilla &tдnne'"
ASSOCIATE_SUBDIR = "Lisдд jдrjestelmдvalikkoon 'Purkaa UniExtractorilla &alikansioon'"
ASSOCIATE_FORCE = "Liitд kaikkiin tuettuihin arkistomuotoihin &vдkisin"
MODIFY_PATH = "Lisдд &polkuun Universal Extractor:in asennuskansio"
DESKTOP_ICON = "Luo pikakuvake &tyцpцydдlle"
QUICK_LAUNCH_ICON = "Luo pika&kдynnistyskuvake"
SENDTO_ICON = "Luo pikakuvake Windowsin 'Lд&hetд'-valikkoon"

; Context Menu integration
EXTRACT_FILES = "Purkaa &UniExtractorilla..."
EXTRACT_HERE = "Purkaa UniExtractorilla &tдnne"
EXTRACT_SUB = "Purkaa UniExtractorilla &alikansioon"
